"""
Задание 2.

Каждое из слов «class», «function», «method» записать в байтовом формате
без преобразования в последовательность кодов
не используя!!! методы encode и decode)
и определить тип, содержимое и длину соответствующих переменных.

Подсказки:
--- b'class' - используйте маркировку b''
--- используйте списки и циклы, не дублируйте функции
"""

items = ['class', 'function', 'method']
for el in items:
    el = bytes(el, 'utf-8')
    print(f'{el}: {type(el)} LENGHT:{len(el)}')